Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes.PlacingDistance Property
 Gets or sets the placing distance attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDistanceAttributes PlacingDistance { get; set; }
Public Property PlacingDistance As PlacingDistanceAttributes
	Get
	Set
Property Value
Type: PlacingDistanceAttributes
See Also
Reference
PlacingAttributes Class
Tekla.Structures.Drawing Namespace